# NetworkBasedCalculations Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..NetworkBasedCalculations Property
DuctSettings Class See Also
---
Indicates whether to enable network based calculations for duct networks.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool NetworkBasedCalculations { get; set; }
```

Visual Basic
---
```text
Public Property NetworkBasedCalculations As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool NetworkBasedCalculations {
	bool get ();
	void set (bool value);
}
```

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace